{
  "sections": {
    "main": {
      "type": "main-article",
      "blocks": {
        "title": {
          "type": "title",
          "settings": {
            "blog_show_date": true,
            "blog_show_author": true,
            "blog_author_name": "Eleanor Hadley",
            "blog_reviewer_name": "",
            "blog_show_readingtime": true
          }
        },
        "featured_image": {
          "type": "featured_image",
          "settings": {
            "image_height": "adapt"
          }
        },
        "content": {
          "type": "content",
          "settings": {
          }
        },
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Choose a lover you trust…",
            "custom_text_body": "<p>It probably goes without saying, but getting your kit off and getting down and dirty in front of a camera requires a hell of a lot of trust. There’s always the chance of someone screenshotting and sharing your images without your consent. Now, I sure hope whoever you have in your intimate life isn’t a total jerk, but it’s always best to take a moment to really consider how much you trust your lover not to do anything untoward while you’re on a live call - or after, for that matter. <\/p><p>Trust goes hand in hand with consent, too. Only ever have video sex with a consenting partner. This means no calling out of the blue without first checking in to ask if they are keen. There’s a time and a place for everything. And you don’t want to catch your lover while they're out to a family lunch while you’re sitting on the other end clad in latex. <\/p>"
          }
        },
        "dbbed86a-1223-4cd9-85eb-98b2175cb969": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Schedule it in…",
            "custom_text_body": "<p>Look, we love spontaneity when it comes to sex, but an impromptu sexy facetime isn’t always going to be ideal. Like we mentioned before, you don’t want to catch your lover when they’re busy at work or surrounded by a group of friends, so it’s best to schedule your session in. I know ‘scheduling’ is a wildly unsexy word, but look at it like this: you have something to look forward to, building up the anticipation and desire, you have time to set up your space, perfect your angles (more on this later), and generally get yourself in the mood. <\/p>"
          }
        },
        "b095f3fd-4d01-4d74-a645-afe88cb56c98": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Not sure how to initiate video sex?",
            "custom_text_body": "<p>Often a facetime sesh can seamlessly flow on from a steamy sexting session. You could seed the idea by first asking to exchange spicy nudes and then perhaps say to your lover, “I’d love to see X in motion”, or “How do you feel about showing me exactly how you like to be touched? Want to facetime?”.<\/p><p>Now, not everyone will be up for it in the moment, so you might like to lock in a video date next time by saying something like,”How about we give each other a show over facetime this Friday night?”. <\/p>"
          }
        },
        "d3991ca9-bcd4-4ff0-8857-5aea36de0a50": {
          "type": "advert",
          "settings": {
            "product_headline": "The essentials for your next video session",
            "product_1": "petit-plaris-bundle",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "066a72e6-84fd-4a5e-ad1d-501db7921626": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Set up your space",
            "custom_text_body": "<p>Okay, we’ve all received those spicy selfies with piles of laundry in the background, or worse dirty dishes peeking out from  behind the goods. Let’s all take a vow from here on out to not be this person! Of course, you’re the star of the shot, but you don’t want your lover to be distracted from your hotness by the mess behind you. So, take a moment before you hop on camera to tidy up your background and ensure any mess is well out of shot. That way, the focus is all on you, baby.<\/p><p>Along with your background being spick and span, make sure you’re going to be comfortable for the duration of the call and that you can have to move around as you need. It can be tempting to strike a sexy pose to answer the call, but be sure to have some firm pillows set up to lean against or another comfy position in mind so you don’t fatigue during your session.<\/p><p>I don’t know about you, but the perfect playlist has the power to shift my energy, influence my mood, relax me and take me to deeper states of pleasure. I suggest finding a sultry, sexy playlist that makes you feel really damn hot to play softly in the background while you do your thing. You want it to be low enough that it doesn’t interfere with you and your lover conversing (or moaning), but high enough that you can hear it and use it to guide your movements.<\/p>"
          }
        },
        "8f5be66a-857d-4fe1-815c-8898b228f942": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Keep the vibes nearby…",
            "custom_text_body": "<p>To set yourself up for a little show and tell, keep your favourite pleasure tools handy. Some <a href=\"\/products\/love-lube\" title=\"Oh La La Love Lube\">Oh La La Love Lube<\/a> will certainly come in handy, along with perhaps the small but mighty <a href=\"\/products\/the-petit-eiffel\" title=\"The Petit Eiffel\">Petit Eiffel<\/a> or ultra versatile <a href=\"\/products\/the-double-entendre\" title=\"The Double Entendre\">Double Entendre<\/a>. Having your faves within reaching distance is exactly what you need to take yourself to orgasm while your lover gets a front row seat.<\/p>"
          }
        },
        "76dee9af-ddc2-46c6-9f3c-d696099b2e97": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Light yourself right",
            "custom_text_body": "<p>There’s a very fine balance between seeing <em>everything<\/em> and barely being able to see anything. Obviously, the point of a video call is to see you in all your glory, but of course we want to feel our sexiest so it’s important to use lighting that flatters you and makes you feel fabulous. Whether that’s natural light, with your phone propped up against a window while you bask in the glow, or some moody salt lamp lighting - be sure to set it up and test it out beforehand. If you have a ring light around, this could be your best friend. Set it up behind your phone on a low level on the glowy yellow\/orange setting rather than the bright white mode to create a smoothing effect that makes your skin pop. Just watch out for any odd shadows casting on your body before you hit ‘call’.<\/p>"
          }
        },
        "5cee75dc-71c1-4dc6-aa5a-e0c8176a6326": {
          "type": "advert",
          "settings": {
            "product_headline": "Everything you need",
            "product_1": "premier-amour-bundle",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "df31badd-375e-49b2-8db7-c37edec099c1": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Secure your phone…",
            "custom_text_body": "<p>There’s no telling how..frisky… things are going to get during your video call, and there’s nothing worse than your phone falling to the floor mid <em>demonstration<\/em>. So, set your phone up somewhere sturdy so it won’t move or fall over when you move around on the bed or wherever you’re set up. If you have a tripod, this is ideal. Otherwise you can get creative with a chair, a stack of books or something else to lean your phone against.<\/p>"
          }
        },
        "99028577-adf2-4288-a167-0fd1fa680f3d": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Know your angles",
            "custom_text_body": "<p>Once you’re set up with your lighting and phone ready to go, give yourself some time to practise your angles. Open up your camera app and start moving around, practising the movements you might make during your video sesh. You can just watch yourself as you move, or you could even film yourself and watch it back. What do you plan to show your lover? How does it look on camera? Can you see from where the phone is, or do you need to move it up or down? <\/p><p>Just be sure not to overthink things here and remember that your lover is IN TO YOU and will love what they see. Strive for sexual expression over perfection here.<\/p>"
          }
        },
        "676a2819-c988-4453-9a10-95df1fed1a24": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Do Not Disturb Mode",
            "custom_text_body": "<p>It’s almost time to get into it now, and the last thing you need is any distractions or unwanted disturbances. A mid session call from your grandma or a housemate walking in on you could really cramp your style, so be sure to put your phone on DND mode to block any notifications from popping up and ensure your bedroom door is locked.<\/p>"
          }
        },
        "33e742ae-a68b-4d6c-b8fe-d50c6ade0256": {
          "type": "advert",
          "settings": {
            "product_headline": "Go all night (even on Facetime)",
            "product_1": "la-machine-damour-ultime",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "e100b907-678f-4d85-b838-8762a6e4e9b0": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Build the antici….pation",
            "custom_text_body": "<p>Okay, it can be tempting to jump straight into it when answering the call, but I promise everything tastes sweeter when you take your time. Build up the sexual tension and tease each other. Spend time chatting and flirting like you would on a date before getting down and dirty, or perhaps get hot and heavy in a sexting session before you dial.<\/p>"
          }
        },
        "bd66d7dd-5054-46fe-8fc4-eec61f89bbc8": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Try a striptease",
            "custom_text_body": "<p>As the creator of <em>The Art of Seduction<\/em>, there’s no way I couldn’t mention strip tease here. There’s something so seductive and downright sexy about starting your video sex sesh fully clothed, and slowly peeling away the layers one by one. The tease is everything here, so take your time, get sultry and make your lover beg to see what’s underneath.<\/p>"
          }
        },
        "4c38fc08-a38e-48c3-b3da-2850fb80af03": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Be vocal…",
            "custom_text_body": "<p>Despite the focus being quite visual on a video call, don’t forget to use your voice! Ask your lover what they’d like to see, tell them how their body and their actions are making you feel, what responses your body is having and don’t forget to moan, baby, moan! Not only is it wildly hot for your lover to hear your pleasure, but voicing your arousal is like fuel to the sexual fire - the more you express, the more you feel.<\/p><p>Video sex can be such a fun and empowering way to spice up your sex-life, so what are you waiting for? Text your boo now and set up a cyber date, set up your space and get ready for a fun new experience!<\/p>"
          }
        },
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814": {
          "type": "cta",
          "disabled": true,
          "settings": {
            "cta-title": "Check this out",
            "cta-image": "shopify:\/\/shop_images\/Frenchie-Lube-Restock-2.1.jpg",
            "cta-link": "https:\/\/getfrenchie.com\/blogs\/news\/7-days-of-pleasure",
            "cta-link-text": "Click Here"
          }
        },
        "359f8fd3-f941-4321-b140-79749829b8d9": {
          "type": "shopify:\/\/apps\/judge-me-product-reviews\/blocks\/all_reviews_page\/61ccd3b1-a9f2-4160-9fe9-4fec8413e5d8",
          "disabled": true,
          "settings": {
            "extra_wrapper_classes": "page-width page-width--narrow"
          }
        },
        "share": {
          "type": "share",
          "settings": {
            "share_label": "Share"
          }
        }
      },
      "block_order": [
        "title",
        "featured_image",
        "content",
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a",
        "dbbed86a-1223-4cd9-85eb-98b2175cb969",
        "b095f3fd-4d01-4d74-a645-afe88cb56c98",
        "d3991ca9-bcd4-4ff0-8857-5aea36de0a50",
        "066a72e6-84fd-4a5e-ad1d-501db7921626",
        "8f5be66a-857d-4fe1-815c-8898b228f942",
        "76dee9af-ddc2-46c6-9f3c-d696099b2e97",
        "5cee75dc-71c1-4dc6-aa5a-e0c8176a6326",
        "df31badd-375e-49b2-8db7-c37edec099c1",
        "99028577-adf2-4288-a167-0fd1fa680f3d",
        "676a2819-c988-4453-9a10-95df1fed1a24",
        "33e742ae-a68b-4d6c-b8fe-d50c6ade0256",
        "e100b907-678f-4d85-b838-8762a6e4e9b0",
        "bd66d7dd-5054-46fe-8fc4-eec61f89bbc8",
        "4c38fc08-a38e-48c3-b3da-2850fb80af03",
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814",
        "359f8fd3-f941-4321-b140-79749829b8d9",
        "share"
      ],
      "settings": {
      }
    },
    "1658801499aa58f4de": {
      "type": "featured-collection",
      "settings": {
        "title": "Our Best Sellers",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "frontpage",
        "products_to_show": 4,
        "columns_desktop": 4,
        "full_width": false,
        "show_view_all": true,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "inverse",
        "image_ratio": "adapt",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "columns_mobile": "2",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "heading": {
          "type": "heading",
          "settings": {
            "heading": "Subscribe to our emails",
            "heading_size": "h1"
          }
        },
        "paragraph": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Be the first to know about new collections and exclusive offers.<\/p>"
          }
        },
        "email-form": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "heading",
        "paragraph",
        "email-form"
      ],
      "settings": {
        "color_scheme": "accent-2",
        "full_width": true,
        "padding_top": 60,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "main",
    "1658801499aa58f4de",
    "newsletter"
  ]
}