{
  "sections": {
    "main": {
      "type": "main-article",
      "blocks": {
        "title": {
          "type": "title",
          "settings": {
            "blog_show_date": true,
            "blog_show_author": true,
            "blog_author_name": "Eleanor Hadley",
            "blog_reviewer_name": "",
            "blog_show_readingtime": true
          }
        },
        "featured_image": {
          "type": "featured_image",
          "settings": {
            "image_height": "adapt"
          }
        },
        "content": {
          "type": "content",
          "settings": {
          }
        },
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a": {
          "type": "custom",
          "settings": {
            "custom_text_title": "What is the purpose of a C-ring?",
            "custom_text_body": "<p>Many people choose to use a c-ring to allow them to stay harder for longer, so they can have more substantial and satisfying sex. Plus, c-rings tend to make your penis appear larger, with the veins more pronounced too, and who doesn’t want that? <\/p><p>The feeling of constriction can enhance your pleasure potential, not to mention that the longer you last, the more time your partner has to reach their orgasmic potential too. A total win-win!<\/p>"
          }
        },
        "823867e1-51ae-4581-92b3-fc7daaa6a216": {
          "type": "advert",
          "settings": {
            "product_headline": "Try Frenchie's C-ring",
            "product_1": "le-coq",
            "product_button_text": "Try a C-Ring Today",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "dbbed86a-1223-4cd9-85eb-98b2175cb969": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Reasons and Benefits to use a C-ring",
            "custom_text_body": "<p><strong>Delay Orgasm<\/strong><br\/>You can use a c-ring anytime you’d like to delay orgasm, enhance orgasm, or just increase overall pleasure. <br\/><br\/>If you’re having sex with a woman or someone with a vulva, it can be really beneficial to prolong your orgasm to allow more time for your partner to reach their orgasm.<\/p><p><strong>Longer sex sessions<\/strong><br\/>Cock rings are a simple tool that open you up to longer and more satisfying sex sessions. Due to the sensation of constriction around the base of penis and the intensified erection, many people find that they can last far longer than usual, and that the orgasms are far more powerful as a result.<\/p><p><br\/><\/p>"
          }
        },
        "bc54f2e8-7d03-48ea-83a4-6d72e44925af": {
          "type": "advert",
          "settings": {
            "product_headline": "Delay and last longer with",
            "product_1": "lendurance-delay-spray",
            "product_button_text": "Last Longer Now",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "647c2c53-c084-4a98-a610-f2673ef88cdf": {
          "type": "custom",
          "settings": {
            "custom_text_title": "",
            "custom_text_body": "<p><strong>Enhanced masturbation<\/strong><\/p><p>You might like to explore adding a c-ring to your personal masturbation practice, or during partnered sex to heighten sensation and create new pleasure pathways. In a way, when we masturbate, we are conditioning ourselves to feel pleasure and reach orgasm in specific ways. And so, it’s really beneficial to switch up our masturbation techniques to open ourselves up to new sensations.<\/p><p><br\/><strong>Make orgasms more intense<\/strong><br\/>When you are reaching the point of ejaculation, naturally the testicles begin to move upwards. But when you’re wearing a c-ring, you’ll feel a sense of resistance which leads to a more powerful orgasm and satisfying release.<\/p><p><strong>Help with Erectile Dysfunction<\/strong><\/p><p>Not only are cock rings fun and pleasurable for you to use, but they can also be extremely beneficial for those who experience erectile dysfunction (ED). One factor that causes ED is the body’s inability to keep enough blood in the penis to get or maintain an erection. Since the pressure of a c-ring restricts blood from flowing back out of the penis and into the body, many find it helps them to get hard and stay hard for longer than they may without it. <br\/><br\/><strong>Boost your confidence<\/strong><\/p><p>It can be understandably stressful sometimes to try and maintain an erection for a long, steamy session. And worrying about whether or not you’ll last doesn’t help either. C-rings help to boost your confidence in lasting longer and with elevated confidence comes heightened pleasure. <\/p><p><\/p><p><strong>Appear larger<\/strong><\/p><p>Speaking of a confidence boost, the use of a c-ring can also make your member look larger due to the increase in blood flow. So, if you’d like to look a bit bigger, a cock ring is your new best friend.<\/p><p><\/p>"
          }
        },
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814": {
          "type": "cta",
          "disabled": true,
          "settings": {
            "cta-title": "Check this out",
            "cta-image": "shopify:\/\/shop_images\/Frenchie-Lube-Restock-2.1.jpg",
            "cta-link": "https:\/\/getfrenchie.com\/blogs\/news\/7-days-of-pleasure",
            "cta-link-text": "Click Here"
          }
        },
        "b095f3fd-4d01-4d74-a645-afe88cb56c98": {
          "type": "custom",
          "settings": {
            "custom_text_title": "How to use a C-ring?",
            "custom_text_body": "<p><strong>Put in on before you’re penis gets too hard<\/strong><br\/>The circular sex tool can be placed on the penis at any stage, but most often it’s advised to put it on while flaccid or semi-hard for ease of use. It’s possible to put a c-ring on a fully erect penis, though it may be uncomfortable and a bit more difficult and will depend which type you choose, so it’s best to pop it on first. <\/p><p><br\/><strong>Wear it around your penis or scrotum<\/strong><\/p><p>You can place your c-ring either around the base of the penis only, or under the scrotum to constrict blood flow from the balls and the shaft.<br\/><br\/>If you’re using it around your testicles, gently place them through one at a time, then you can fold and slip your penis through. <a href=\"\/collections\/love-lube\" title=\"Water-Based Aloe Vera Lube\">Lube<\/a> will make this process far easier. Or, you can place the c-ring over your penis first and then stretch it around and underneath your scrotum to get the testicles inside the ring. <\/p><p>If you’re using it for the penis only, then simply slide it all the way down to the base of the shaft, nice and close to your body.<\/p><p> <br\/><strong>Use a high-quality water-based lubricant<\/strong><\/p><p>Start by grabbing some good quality water-based lubricant, like <a href=\"\/products\/love-lube\" title=\"Oh La La Love Lube\">Frenchie’s Oh La La Love Lube<\/a>, and place a few drops on the inside of the ring to allow for your c-ring to slide smoothly over your penis and to avoid any unwanted friction, snags or pulling on the skin or hair. A quick note on lube - it’s always recommended to use a water-based lube with sex toys, especially silicone ones. Using silicone lube with a silicone toy can cause it to corrode and cause damage. Not ideal!<\/p>"
          }
        },
        "7d6f9422-ecb0-49ef-8ed7-57e77c09b4f4": {
          "type": "advert",
          "settings": {
            "product_headline": "",
            "product_1": "love-lube",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "ad36aec8-e121-4dc6-92a6-82d957bc5868": {
          "type": "custom",
          "settings": {
            "custom_text_title": "How to know the best Cock ring size for you",
            "custom_text_body": "<p>Many cock rings, like <a href=\"\/products\/le-coq\" title=\"Le Coq\">Frenchie’s Le Coq<\/a>, will be made of very stretchy medical-grade silicone to allow versatility with penis size. Plus, they will often come in a set of three so you can find your perfect fit and even experiment with the other sizes as you get comfortable using them.<\/p><p>An easy way to measure to ensure the right size, is to use a piece of string or floss and gently wrap this around either the base of your penis or your penis and underneath your testicles. Then, simply measure this diameter and compare it to the cock ring you are selecting. You want it to feel snug, but not too tight.<\/p>"
          }
        },
        "cf860add-28f3-438b-b25a-9a238d0d42e9": {
          "type": "custom",
          "settings": {
            "custom_text_title": "What are weighted C-rings?",
            "custom_text_body": "<p>Some c-rings come in different weights for an added element and sensation. It’s recommended to start with a low weight and work up as you feel comfortable. Be sure not to go too heavy as you could risk tissue or nerve damage if they are too strong.<\/p>"
          }
        },
        "f2305d9c-b900-4b20-a3df-22f1f0abb46d": {
          "type": "custom",
          "settings": {
            "custom_text_title": "What is the best or safest material for a C-ring?",
            "custom_text_body": "<p>C-rings can come in many different materials such as latex, silicone, rubber and steel. The safest and most versatile option is a medical grade silicone, as it’s soft, hypoallergenic and very comfortable. <\/p><p>Frenchie’s Le Coq is made from a soft, stretchy medical grade silicone that is odourless and non-porous. It’s important to always use high quality sex toys to mitigate any risk of infections, which is why non-porous materials are best.<\/p>"
          }
        },
        "4d2dd8a7-9a4d-4258-a138-42ea89a53369": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Best way to store and care for your C-rings",
            "custom_text_body": "<p>As with any sex toy, always clean your c-ring before and after each use with a <a href=\"\/products\/oui-oui-wipes\" title=\"Oui Oui Wipes\">sex toy cleaner<\/a> or a fragrance free soap with warm water. Dry off with a fresh, clean towel, ensuring there is no fluff that transfers on to the device. If you have a high-quality c-ring made from superior material, it will last you for years to come.<\/p>"
          }
        },
        "0bf7a515-e738-494d-b5fe-64cdf6fe4ecc": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Are C-rings safe to use?",
            "custom_text_body": "<p>C-rings are a very safe and pleasurable sex toy to use in most cases with proper use. It’s recommended to only wear one for a maximum of about 30 minutes, as much longer can cause excessive pressure on the penis which can result in cell damage. Try to stick to using body safe and flexible materials like hypoallergenic medical grade silicone to avoid allergic reactions and irritation of the skin or excessive constriction.<\/p>"
          }
        },
        "6701bb52-55ec-45ec-aeea-004fac732962": {
          "type": "custom",
          "settings": {
            "custom_text_title": "What are the warning signs to stop using a C-ring?",
            "custom_text_body": "<p>If you feel any type of discomfort or pain rather than pleasure, remove it immediately. <\/p><p>Particularly if you notice your penis turning bright red or blue, or if there is a visible narrowing of the penis near the c-ring.<\/p><p>If you can’t easily slip your c-ring off after ejaculation, try using some lube to slide it off. If you still can’t get it off, you may have chosen a size too small. In this case, it's best to see a doctor right away.<\/p>"
          }
        },
        "ad94ee9e-1181-4f6a-b2f8-5a5219b46cc0": {
          "type": "custom",
          "settings": {
            "custom_text_title": "What are the safety precautions before using a C-ring?",
            "custom_text_body": "<p>Always be sure to place your c-ring on before you get hard for ease of use. You’ll want to remove it soon after ejaculation and be sure to only wear it for a maximum of 30 minutes. You may also experience some pulling or rubbing on your pubic hair, so it can be helpful to give yourself a trim before use.<\/p><p>If you feel concerned<strong> <\/strong>about<strong> <\/strong>it getting stuck, rest assured that most c-rings are made from very flexible silicone that can be stretched easily to pull off, and some even have Velcro or other fasteners to allow for easy removal. <\/p>"
          }
        },
        "11122f45-6fa7-4da9-bb99-e86b003bb0c8": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Who should you consult first before using a C-ring?",
            "custom_text_body": "<p>Most people can safely use a c-ring without needing to consult a physician. However, if you have certain medical conditions it is best to consult your doctor. If you have an existing injury to your penis, a cock ring is not ideal. If you have concerns like heart or nerve disease, diabetes or other penile health conditions or are on blood thinners, be sure to chat with your doctor before use.<\/p>"
          }
        },
        "8bc6ed54-550f-4676-9f53-4f0c3f2daea3": {
          "type": "advert",
          "settings": {
            "product_headline": "",
            "product_1": "le-coq",
            "product_button_text": "Buy Now",
            "product_2": "la-machine-damour-ultime",
            "product_button_text_2": "Buy Now",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "share": {
          "type": "share",
          "settings": {
            "share_label": "Share"
          }
        }
      },
      "block_order": [
        "title",
        "featured_image",
        "content",
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a",
        "823867e1-51ae-4581-92b3-fc7daaa6a216",
        "dbbed86a-1223-4cd9-85eb-98b2175cb969",
        "bc54f2e8-7d03-48ea-83a4-6d72e44925af",
        "647c2c53-c084-4a98-a610-f2673ef88cdf",
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814",
        "b095f3fd-4d01-4d74-a645-afe88cb56c98",
        "7d6f9422-ecb0-49ef-8ed7-57e77c09b4f4",
        "ad36aec8-e121-4dc6-92a6-82d957bc5868",
        "cf860add-28f3-438b-b25a-9a238d0d42e9",
        "f2305d9c-b900-4b20-a3df-22f1f0abb46d",
        "4d2dd8a7-9a4d-4258-a138-42ea89a53369",
        "0bf7a515-e738-494d-b5fe-64cdf6fe4ecc",
        "6701bb52-55ec-45ec-aeea-004fac732962",
        "ad94ee9e-1181-4f6a-b2f8-5a5219b46cc0",
        "11122f45-6fa7-4da9-bb99-e86b003bb0c8",
        "8bc6ed54-550f-4676-9f53-4f0c3f2daea3",
        "share"
      ],
      "settings": {
      }
    },
    "1658801499aa58f4de": {
      "type": "featured-collection",
      "settings": {
        "title": "Our Best Sellers",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "frontpage",
        "products_to_show": 4,
        "columns_desktop": 4,
        "full_width": false,
        "show_view_all": true,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "inverse",
        "image_ratio": "adapt",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "columns_mobile": "2",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "heading": {
          "type": "heading",
          "settings": {
            "heading": "Subscribe to our emails",
            "heading_size": "h1"
          }
        },
        "paragraph": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Be the first to know about new collections and exclusive offers.<\/p>"
          }
        },
        "email-form": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "heading",
        "paragraph",
        "email-form"
      ],
      "settings": {
        "color_scheme": "accent-2",
        "full_width": true,
        "padding_top": 60,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "main",
    "1658801499aa58f4de",
    "newsletter"
  ]
}