{
  "sections": {
    "main": {
      "type": "main-article",
      "blocks": {
        "title": {
          "type": "title",
          "settings": {
            "blog_show_date": true,
            "blog_show_author": true,
            "blog_author_name": "Yarden Grinberg",
            "blog_reviewer_name": "",
            "blog_show_readingtime": true
          }
        },
        "featured_image": {
          "type": "featured_image",
          "settings": {
            "image_height": "adapt"
          }
        },
        "content": {
          "type": "content",
          "settings": {
          }
        },
        "438f1196-4233-4a94-b61b-a44e0a65588e": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Well-known Erogenous Zones",
            "custom_text_body": "<p>As mentioned earlier, there are some better known zones that when touched tend to send shivers down your spine and open the flood gates (almost literally). These zones include anywhere in and around the vagina, the penis and scrotum, and the anus.<\/p><p>Unsure why touching these areas gives you butterflies? Here’s a list! <\/p><p><strong>Vagina:<\/strong> If we had all day, we would go through the trillion and one individual erogenous zones in the vaginal area. But to spare you the lengthy read, we will keep it short and sweet. Between the clitoris, G-spot and the vaginal canal. The clitoris alone has over 8000 nerve endings, and the vaginal canal is located in the sensory cortex, the area of the brain that receives and interprets sensory stimulation.<\/p><p><strong>Penis:<\/strong> The head of the penis is the most sensitive part of the penis, so it can be given special attention. There are plenty of toys that can be used to help stimulate this area or you can tease the area with your fingers.<\/p><p><strong>Scrotum:<\/strong> The thinnest skin award goes to the scrotum. Although this area may feel nice to touch, you need to be gentle! You can focus on the highly sensitive scrotal raphe or the seam that runs down your scrotum.<\/p><p><strong>Anus:<\/strong> The anus climbed to popularity as an erogenous zone due to the amount of nerve endings. Anal play gives a feeling of fullness and some enjoy the feeling of stretching. For any sort of anal, you want to focus on taking it slow and have lots of lube to hand, and if using toys, ensure they have a flared base so they can’t get stuck up there.<\/p><p>Of course there are other well-known zones that aren’t as risque as the genitals. Touching areas such as the nipples, the lips, neck and inner thighs are all areas on the body that will make your body tingle! <\/p><p><strong>Nipples\/breasts<\/strong>: touching your boobs feels great not just because they're packed with nerve endings but because we have a lot of psychological associations between them and sex. As for nipples, some people have extremely sensitive nipples and can even orgasm from nipple play alone. <\/p><p><strong>Lips<\/strong>: These are considered the sexiest part of the face, they’re filled with nerve endings and lightly touching them can send tingles up your spine. Studies also show that kissing releases neurotransmitters, which boost mood and regulate sexual desire.<\/p><p><strong>Neck<\/strong>: Ever wondered why your neck is ticklish 99% of the day, except when it’s time to get down to business? The skin of your neck is very thin, and a whole bunch of sensory nerves are clustered there, so while you’re aroused, this ticklish sensation turns into a sexually exciting feeling.<\/p><p><strong>Inner Thighs<\/strong>: This one is a bit of a no-brainer, as the inner thighs are literally neighbours to the genitals, it's not hard to imagine why this particular erogenous zone is so popular.<\/p><p>When participating in solo play, you can use your <a href=\"\/products\/the-petit-eiffel\" title=\"The Petit Eiffel\">vibrator<\/a>, especially a mini vibrator with a flutter tip, to really stimulate these areas and build up arousal before your big finish!<\/p>"
          }
        },
        "823867e1-51ae-4581-92b3-fc7daaa6a216": {
          "type": "advert",
          "settings": {
            "product_headline": "Explore something new with The Petit Eiffel",
            "product_1": "the-petit-eiffel",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "2f426762-cd78-4a57-a038-ab22a582f413": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Lesser-Known Erogenous Zones",
            "custom_text_body": "<p>As fun as the more well-known zones are to stimulate, there are some less obvious, and probably surprising zones that can help get you in the mood! Areas such as the lower stomach, the hands, the ears and behind the knees are also filled with nerve endings and make for great spots to tease and touch. <\/p><p><strong>Lower Stomach:<\/strong> Much like the inner thighs, this is an arousing area because of the close proximity to our genitals. When touched, blood rushes to the more well known erogenous zones mentioned above. This area is also not often exposed, so when it does become visible it’s almost considered a hot spot (pun intended).<\/p><p><strong>Hands:<\/strong> Our hands have fingers, and our fingers have a tonne of nerve endings to help us understand what we are touching. Also the idea of someone sucking on our fingers can arouse all sorts of sexual dynamics, and some find this super hot.<\/p><p><strong>Ears: <\/strong>As with every other area mentioned, the ears are yet again filled with a lot of nerve endings, nearly as many as the hands! What makes the ears different is that they are in a vulnerable area of the body, close to the face and head, which is an area that others don’t regularly get close to. <\/p><p><strong>Behind the Knees:<\/strong> The phrase weak at the knees didn’t come from thin air! The skin in this area is very thin, meaning that a slight touch or brushing can send sweet sensations through the body. <\/p><p>Although these areas may not get you off (but you truly never know until you try), exploring them is a great way to build up that arousal, prolonging your finish and in turn having a better (and bigger) orgasm. Who wouldn’t want that?! Try to stimulate these areas with soft touches, maybe even a feather if you have one handy! <\/p>"
          }
        },
        "cf9b16cf-7978-47af-a8ab-d080baaa7d6c": {
          "type": "custom",
          "settings": {
            "custom_text_title": "",
            "custom_text_body": "<p>To summarise, our bodies are beautiful things designed to receive as much pleasure as possible! Just because you know exactly how to get yourself off in 3 minutes or less, doesn’t mean you shouldn’t try to have a little foreplay with yourself and experience greater pleasure. As John Mayer put it best, <em>your body is a wonderland<\/em> so you should explore it!<\/p>"
          }
        },
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "What You Can Do If All Else Fails",
            "custom_text_body": "<p><strong>Sexual Therapy<\/strong><\/p><p>There are specialist therepists who are trained in understanding the psychology of human sexulatiy, sex and relationships. They will be able to help you uncover what might going on for you, and give you the tools to help you overcome it.<\/p><p><\/p><p>Guided imagery is a method for managing your stress. It’s a relaxation technique that involves visualizing positive, peaceful settings like a beautiful beach or a peaceful meadow. This technique is also known as visualization or guided meditation.<\/p><p><strong>Guided Imagery<\/strong><\/p><p>It can be useful for ED as it helps you ground and relax before getting physical intimate. If abstract images like a calm beach don’t do it for you, it can also be helpful to visualise the sexaual energy in your body flowing into your genitals. <\/p><p><strong>Meditation <\/strong><\/p><p>Mindfulness or meditation is another useful tool that helps feel more calm , present and connected to our body. These are great skills for anyone experiencing ED. <\/p><p>Practice your mind\/body connection through mindfulness exercises such as body scans to help you still your mental world and focus on your physcial sensations. <\/p>"
          }
        },
        "dbbed86a-1223-4cd9-85eb-98b2175cb969": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "When to see a GP?",
            "custom_text_body": "<p>Of course, not all ED is caused by psychological or emotional reasons. <\/p><p>ED can be a symptom of many physical health concerns, and there might be something more serious going on. <\/p><p>It’s <span style=\"text-decoration:underline\">always<\/span> worthwhile seeing a GP to check nothing is going on physically. <\/p><p>This is especially true if:<\/p><p>- you can’t work out any emotional reasons for the change<\/p><p> - if you have diabetes, heart disease or another known health condition that might be linked to erectile dysfunction<\/p><p> -or you have other symptoms along with erectile dysfunction<\/p><p><\/p><p><\/p>"
          }
        },
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814": {
          "type": "cta",
          "disabled": true,
          "settings": {
            "cta-title": "Check this out",
            "cta-image": "shopify:\/\/shop_images\/Frenchie-Lube-Restock-2.1.jpg",
            "cta-link": "https:\/\/getfrenchie.com\/blogs\/news\/7-days-of-pleasure",
            "cta-link-text": "Click Here"
          }
        },
        "b095f3fd-4d01-4d74-a645-afe88cb56c98": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "Summary",
            "custom_text_body": "<p>ED is much more common than people like to admit, and it is very very normal. Everybody experiences times of stress, worry or anxiety in life, and it is only natural for this to affect our sex life. <\/p><p>Sadly the silence,embarrassment and shame that often surrounds these conversations makes the problem worse, not better.<\/p><p>Instead, try and create an environment where pleasure and relaxation is the goal, and remove the pressure for an erection. When you stop fixating on the erection, you will discover that you are still capable of so much pleasure.<\/p>"
          }
        },
        "share": {
          "type": "share",
          "settings": {
            "share_label": "Share"
          }
        }
      },
      "block_order": [
        "title",
        "featured_image",
        "content",
        "438f1196-4233-4a94-b61b-a44e0a65588e",
        "823867e1-51ae-4581-92b3-fc7daaa6a216",
        "2f426762-cd78-4a57-a038-ab22a582f413",
        "cf9b16cf-7978-47af-a8ab-d080baaa7d6c",
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a",
        "dbbed86a-1223-4cd9-85eb-98b2175cb969",
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814",
        "b095f3fd-4d01-4d74-a645-afe88cb56c98",
        "share"
      ],
      "settings": {
      }
    },
    "1658801499aa58f4de": {
      "type": "featured-collection",
      "settings": {
        "title": "Our Best Sellers",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "frontpage",
        "products_to_show": 4,
        "columns_desktop": 4,
        "full_width": false,
        "show_view_all": true,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "inverse",
        "image_ratio": "adapt",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "columns_mobile": "2",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "heading": {
          "type": "heading",
          "settings": {
            "heading": "Subscribe to our emails",
            "heading_size": "h1"
          }
        },
        "paragraph": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Be the first to know about new collections and exclusive offers.<\/p>"
          }
        },
        "email-form": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "heading",
        "paragraph",
        "email-form"
      ],
      "settings": {
        "color_scheme": "accent-2",
        "full_width": true,
        "padding_top": 60,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "main",
    "1658801499aa58f4de",
    "newsletter"
  ]
}