{
  "sections": {
    "main": {
      "type": "main-article",
      "blocks": {
        "title": {
          "type": "title",
          "settings": {
            "blog_show_date": true,
            "blog_show_author": true,
            "blog_author_name": "Eleanor Hadley",
            "blog_reviewer_name": "",
            "blog_show_readingtime": true
          }
        },
        "featured_image": {
          "type": "featured_image",
          "settings": {
            "image_height": "adapt"
          }
        },
        "content": {
          "type": "content",
          "settings": {
          }
        },
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a": {
          "type": "custom",
          "settings": {
            "custom_text_title": "1. Mindful Masturbation",
            "custom_text_body": "<p>The way you pleasure yourself, has a huge impact on the way you experience partnered sex. So, if you’re masturbating in the same way you’ve always done, sprinting to the finish line, furiously rubbing one out with ejaculation as the one and only goal - it’s likely that you’ll come in a similar way when you’re with a partner. A great way to combat this is by switching up your masturbation game, trying new positions, tuning in to the subtle senses and slowing down. Focus on the overall experience of pleasure, as opposed to racing to the big finale. Try incorporating some of the following practices into your masturbation routine, too, and you’ll be well on your way to long-lasting sex. <\/p>"
          }
        },
        "dbbed86a-1223-4cd9-85eb-98b2175cb969": {
          "type": "custom",
          "settings": {
            "custom_text_title": "2. Breath",
            "custom_text_body": "<p>The ability to maintain erections and last longer is hugely dependent on your parasympathetic nervous system (PNS), which is responsible for allowing adequate blood flow into the penis, among other things. Unfortunately, anxiety and nervousness over performance tend to trigger the sympathetic nervous system (SNS), causing an increase in heart rate and the constriction of blood vessels, resulting in a flaccid penis. So, one of the keys to longer, more satisfying sex could very well be your ability to switch off your SNS and switch on your PNS. <\/p><p>One of the simplest ways to activate the PNS, is through your breath. The deeper and more intentional your breath, the more your blood vessels will open to allow that all important blood flow to your penis and the more pleasure you will experience. Try slowing down your breath during sex, taking long, deep breaths into the belly. Practise this during masturbation to get the hang of it, and communicate with your partner too when you need to slow the breath down. Deep breathing is beneficial for everyone’s pleasure, so don’t sleep on this super simple technique!<\/p>"
          }
        },
        "b095f3fd-4d01-4d74-a645-afe88cb56c98": {
          "type": "custom",
          "settings": {
            "custom_text_title": "3. Pelvic Exercises",
            "custom_text_body": "<p>The pelvic floor muscles play a huge role in sexual function, and with some simple daily exercises of this region, can help you make love for longer. Kegel exercises can help you strengthen the muscles involved in ejaculation, giving you more control. It’s always best to consult a pelvic floor physio for a personalised program, but you can try this simple technique a few times a day to get started.<\/p><p>Start by gently squeezing the muscles you would engage to stop the flow of urination. Hold for 10 seconds, release and repeat 10 times. Try not to clench the anus or thigh muscles and instead focus on engaging the small, subtle, internal muscles.<\/p>"
          }
        },
        "a8d7f27f-991e-498f-9b8c-8f7889e845f9": {
          "type": "advert",
          "settings": {
            "product_headline": "Always be prepared",
            "product_1": "deux-beret-condom-bundle",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "066a72e6-84fd-4a5e-ad1d-501db7921626": {
          "type": "custom",
          "settings": {
            "custom_text_title": "4. Base Massage",
            "custom_text_body": "<p>This practice can be helpful to throw into your masturbation routine, and is essentially an edging technique (more on edging later). Also known as ‘penis root massage’, the technique of base massage involves applying pressure to the very base of your penis, near where it meets the body. Use two thumbs and massage in a circular or up and down motion until you feel close to ejaculation, and then back off. The focus on stimulating the base as opposed to the shaft and head of the penis will bring a whole new sensation, while strengthening the muscles involved in ejaculation. This will feel very different from regular masturbation, but it can be really helpful in the long run.<\/p>"
          }
        },
        "8f5be66a-857d-4fe1-815c-8898b228f942": {
          "type": "custom",
          "settings": {
            "custom_text_title": "5. Pre-Sex Masturbation",
            "custom_text_body": "<p>A tried and true technique that conjures up <em>that <\/em>scene from ‘There’s Something About Mary’, giving yourself a pre-date release can be a helpful way to last longer. It’s not always a sure thing, as the refractory period (time between erections) can vary anywhere between a few minutes and a few hours, but masturbating shortly before you know you’re going to have intercourse could be useful.<\/p>"
          }
        },
        "cbec9ef4-e6ad-4b09-87c2-1a623f822eb8": {
          "type": "custom",
          "settings": {
            "custom_text_title": "6. Slow Sex",
            "custom_text_body": "<p>Rather than the classic jackhammer and racing to the finish line, slow down and take your tiiiiiime. Think about stimulating different parts of your body as opposed to hyper focussing on the genitals only. If you’re having sex with a woman or someone with a vulva, it’s always super helpful to slow down during sex to allow time for their arousal to build. <\/p>"
          }
        },
        "65ba5d0f-6df7-443e-a604-46db7ebc1ece": {
          "type": "custom",
          "settings": {
            "custom_text_title": "7. Switch Positions",
            "custom_text_body": "<p>Certain positions might cause more or less extreme stimulation, so if you know of a particular position that makes you come quickly, try to avoid that one either altogether or until you’re ready. Experiment with different positions that feel pleasurable while not getting you too over-excited. In tandem with other techniques, choosing positions that support you can help extend your pleasure session. <\/p>"
          }
        },
        "4b22755f-d67f-442c-88fe-c1aa97ecc4e4": {
          "type": "custom",
          "settings": {
            "custom_text_title": "8. Edging",
            "custom_text_body": "<p>The practice of edging is a really great way to both extend and enhance pleasure. Essentially, you bring yourself close to orgasm, and then stop all stimulation of the genitals or erogenous zones, allowing you to bring the arousal level down. Then, once you’re ready, you can begin stimulation again, repeating the process as many times as you like before allowing yourself to come. Edging can take some practice to get the hang of, so try it during masturbation until you’re comfortable enough to incorporate it into your partnered sex life.<\/p>"
          }
        },
        "1c5e47b9-3890-4962-b6d5-5547488b1538": {
          "type": "custom",
          "settings": {
            "custom_text_title": "9. Squeeze Method",
            "custom_text_body": "<p> This method is great to use in the heat of the moment when you feel yourself about to come and want to try and stop ejaculation in its tracks. It's typically your go-to if you haven’t quite been able to control your edging practice, too. All you need to do is wrap your fingers around the head of your penis and apply some firm pressure and wait for the urge to subside. Slow, deep breaths here are perfect to soothe the nervous system and encourage that all important blood flow.<\/p>"
          }
        },
        "a4849134-07c7-45a4-b019-d9fe8ebfe683": {
          "type": "advert",
          "settings": {
            "product_headline": "Go for longer with Le Coq",
            "product_1": "le-coq",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "7d4cc2de-3565-40b2-935e-52ce2c6b50c8": {
          "type": "custom",
          "settings": {
            "custom_text_title": "10. Cock Rings",
            "custom_text_body": "<p>The technique of applying pressure can also be utilised with the aid of a c-ring. Cock rings, also known as constriction rings or penis rings are worn at the base of the penis and help to constrict the blood flow from leaving the penis and thus are useful in maintaining an erection. Use a stretchy silicone cock ring, such as <a href=\"\/products\/le-coq\" title=\"Le Coq\">Le Coq<\/a>, by sliding it down to the base of a flaccid penis before you get aroused. You can also use a c-ring around the scrotum as well as the penis for additional stimulation.<\/p>"
          }
        },
        "5c05425b-8135-405b-9e2e-4d69f8a55b9e": {
          "type": "custom",
          "settings": {
            "custom_text_title": "11. Condoms",
            "custom_text_body": "<p>While many people complain that condoms reduce sensation, this can actually work in your favour when it comes to lasting longer in the sack. <a href=\"\/products\/deux-beret-condom-bundle\" title=\"Deux Beret Condom Bundle\">Condoms<\/a> are of course a safe sex essential, but they're also a great way to potentially help to keep yourself at bay for longer. Stock up on Frenchie’s Beret Condoms to ensure you’re always covered. For bonus points, try masturbating with condoms on too to train yourself to last longer.<\/p>"
          }
        },
        "a6bdee5a-045e-4e50-8dfa-f9efc74050ed": {
          "type": "custom",
          "settings": {
            "custom_text_title": "12. Delay Spray",
            "custom_text_body": "<p>Another simple solution to PE, or simply as an aid to help you unleash your inner sex machine, is the use of a delay spray such as <a href=\"\/products\/lendurance-delay-spray\" title=\"L'Endurance Delay Spray\">L’Endurance<\/a>. Delay sprays work to mildly desensitise the penis to reduce overstimulation, allowing you to go and go and go. Simply spray it on 15-20 minutes before intercourse, wipe away any excess then be prepared to play long.<\/p>"
          }
        },
        "3341f9b1-a4be-4c7a-83fa-1714b847146d": {
          "type": "advert",
          "settings": {
            "product_headline": "Spray on, play long",
            "product_1": "lendurance-delay-spray",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "d3955250-819e-4f63-9766-729a55afa418": {
          "type": "custom",
          "settings": {
            "custom_text_title": "",
            "custom_text_body": "<p>Regardless of whether you are amongst the 1 in 3 men who have experienced PE, or you simply want to explore longer lasting sex, there are so many techniques for you to explore. Try out as many as you can, and you’ll be well on your way to that revered marathon sex.<\/p>"
          }
        },
        "823867e1-51ae-4581-92b3-fc7daaa6a216": {
          "type": "advert",
          "disabled": true,
          "settings": {
            "product_headline": "Our Le Masque makes for perfect blindfold play",
            "product_1": "le-masque",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814": {
          "type": "cta",
          "disabled": true,
          "settings": {
            "cta-title": "Check this out",
            "cta-image": "shopify:\/\/shop_images\/Frenchie-Lube-Restock-2.1.jpg",
            "cta-link": "https:\/\/getfrenchie.com\/blogs\/news\/7-days-of-pleasure",
            "cta-link-text": "Click Here"
          }
        },
        "359f8fd3-f941-4321-b140-79749829b8d9": {
          "type": "shopify:\/\/apps\/judge-me-product-reviews\/blocks\/all_reviews_page\/61ccd3b1-a9f2-4160-9fe9-4fec8413e5d8",
          "disabled": true,
          "settings": {
            "extra_wrapper_classes": "page-width page-width--narrow"
          }
        },
        "e9695b54-795d-4a9a-a664-a7f431ca0122": {
          "type": "advert",
          "settings": {
            "product_headline": "Try one of our lover's kits to level up your pleasure",
            "product_1": "lultimate-lovers-kit",
            "product_button_text": "View Product",
            "product_2": "lovers-kit",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "share": {
          "type": "share",
          "settings": {
            "share_label": "Share"
          }
        }
      },
      "block_order": [
        "title",
        "featured_image",
        "content",
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a",
        "dbbed86a-1223-4cd9-85eb-98b2175cb969",
        "b095f3fd-4d01-4d74-a645-afe88cb56c98",
        "a8d7f27f-991e-498f-9b8c-8f7889e845f9",
        "066a72e6-84fd-4a5e-ad1d-501db7921626",
        "8f5be66a-857d-4fe1-815c-8898b228f942",
        "cbec9ef4-e6ad-4b09-87c2-1a623f822eb8",
        "65ba5d0f-6df7-443e-a604-46db7ebc1ece",
        "4b22755f-d67f-442c-88fe-c1aa97ecc4e4",
        "1c5e47b9-3890-4962-b6d5-5547488b1538",
        "a4849134-07c7-45a4-b019-d9fe8ebfe683",
        "7d4cc2de-3565-40b2-935e-52ce2c6b50c8",
        "5c05425b-8135-405b-9e2e-4d69f8a55b9e",
        "a6bdee5a-045e-4e50-8dfa-f9efc74050ed",
        "3341f9b1-a4be-4c7a-83fa-1714b847146d",
        "d3955250-819e-4f63-9766-729a55afa418",
        "823867e1-51ae-4581-92b3-fc7daaa6a216",
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814",
        "359f8fd3-f941-4321-b140-79749829b8d9",
        "e9695b54-795d-4a9a-a664-a7f431ca0122",
        "share"
      ],
      "settings": {
      }
    },
    "1658801499aa58f4de": {
      "type": "featured-collection",
      "settings": {
        "title": "Our Best Sellers",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "frontpage",
        "products_to_show": 4,
        "columns_desktop": 4,
        "full_width": false,
        "show_view_all": true,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "inverse",
        "image_ratio": "adapt",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "columns_mobile": "2",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "heading": {
          "type": "heading",
          "settings": {
            "heading": "Subscribe to our emails",
            "heading_size": "h1"
          }
        },
        "paragraph": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Be the first to know about new collections and exclusive offers.<\/p>"
          }
        },
        "email-form": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "heading",
        "paragraph",
        "email-form"
      ],
      "settings": {
        "color_scheme": "accent-2",
        "full_width": true,
        "padding_top": 60,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "main",
    "1658801499aa58f4de",
    "newsletter"
  ]
}