{
  "sections": {
    "main": {
      "type": "main-article",
      "blocks": {
        "title": {
          "type": "title",
          "settings": {
            "blog_show_date": true,
            "blog_show_author": true,
            "blog_author_name": "Eleanor Hadley",
            "blog_reviewer_name": "",
            "blog_show_readingtime": true
          }
        },
        "featured_image": {
          "type": "featured_image",
          "settings": {
            "image_height": "adapt"
          }
        },
        "content": {
          "type": "content",
          "settings": {
          }
        },
        "af3bd32a-1f5f-42c0-9901-ef27f5e0d491": {
          "type": "custom",
          "settings": {
            "custom_text_title": "How Cock rings help with Erectile Dysfunction",
            "custom_text_body": "<p>Erectile Dysfunction refers to the difficulty or inability to get and maintain an erection, and can put a real dampener on your sex life when you’re unable to get sufficiently aroused to have sex. ED doesn’t correlate to a reduced desire for sex, but rather it’s that the physical manifestation of desire, the arousal and subsequent erection, is not functioning as it normally would.<\/p><p>Typically, when you’re sexually aroused, your brain sends a message to your blood vessels in your penis to increase blood flow, causing the firm and hard appearance we know as an erection, or a boner. <\/p><p>For a penis to stay erect, the blood vessels need to close off the blood flow back out of the penis until after ejaculation or the culmination of sexual arousal. In cases of ED the blood vessels aren’t properly allowing the blood to flow into the penis in the first place, and often aren’t closing off adequately to allow the erection to last the full duration of a typical sexual encounter.<\/p><p><a href=\"\/products\/le-coq\" title=\"Le Coq\">Cock rings<\/a> can be a helpful tool for those experiencing symptoms of ED as they provide a constriction around the base of the penis, which essentially slows the blood flow from out of the penis and back into the body. And so, if you’re able to achieve a partial or full erection, using a penis ring can help you maintain it.<\/p><p>Not only does a c-ring help to keep you harder for longer, but the constriction around the base of the penis adds a pleasant, firm sensation that can feel really pleasurable for the wearer. It also increases stimulation, adding a whole new element to sex.<\/p>"
          }
        },
        "e76e984e-79e5-41fc-9e36-a9cac2b1bfa0": {
          "type": "advert",
          "settings": {
            "product_headline": "C-rings to help you go longer",
            "product_1": "le-coq",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "bed2e12d-ccf3-4b61-a43b-f301ff430db1": {
          "type": "custom",
          "settings": {
            "custom_text_title": "How Cock rings help with Premature Ejaculation",
            "custom_text_body": "<p>Many men have experienced premature ejaculation - or ejaculating before they wanted to, at some point in their lives. In fact, it is the most common sexual problem to affect men and those with penises.<\/p><p>However, a diagnosis of premature ejaculation tends to coincide with ejaculating within 1-3 minutes of penetration or the inability to delay ejaculation either every time or almost every time during sex. <\/p><p>Understandably, PE can be quite a distressing condition to endure, and can often cause a loss in sexual confidence and even an avoidance of intimacy altogether.<\/p><p>While there’s not as much research into the use of c-rings to help with premature ejaculation as there is for erectile dysfunction, there’s plenty of anecdotal evidence that they can be incredibly effective in helping people last longer in bed. <\/p><p>Since blood tends to flow out of the penis post ejaculation, the use of a cock ring can be beneficial due to the way it constricts the blood vessels around the base and slows it down from leaving the penis too soon. Many people find that using cock rings allows them to stay harder for much longer than usual, making it an effective tool against PE.<\/p>"
          }
        },
        "74618ec1-d8e3-4453-9c5c-9b494dfb38e5": {
          "type": "custom",
          "settings": {
            "custom_text_title": "How to use a cock ring to help with ED and PE",
            "custom_text_body": "<p>Using a cock ring is simple and easy:<\/p><ul><li>Grab some good quality water based lube (we love Frenchie’s <a href=\"\/products\/love-lube\" title=\"Oh La La Love Lube\">Oh La La Love Lube<\/a>) and squeeze a small amount inside the ring to allow it to glide smoothly along the shaft. You may also like to apply some on the shaft and around the balls too.<\/li><li>When flaccid, slide the ring down the shaft to the base of the penis, or if you’re using one around the balls too, gently place one testicle through the ring at a time and then fold the penis through next.<\/li><li>Get yourself aroused to the point of erection, and enjoy the firm but gentle (not tight) sensation around the base of your penis.<\/li><li>Wear the cock ring for a maximum of 20-30 minutes only<\/li><\/ul><p>Gently slide the ring off and be sure to wash with a quality toy cleaner or fragrance-free soap and warm water.<\/p>"
          }
        },
        "effae05b-0392-4106-b39f-977cee9e326d": {
          "type": "advert",
          "settings": {
            "product_headline": "Grab our Oh La La Love Lube",
            "product_1": "love-lube",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "305753e1-d53a-4828-bc2c-34873934a0b5": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Precautions in using a cock ring",
            "custom_text_body": "<p>When it comes to using a cock ring, there are a few things to keep in mind before you get started.<\/p><p><em><strong>Use a high quality c-ring only<\/strong><\/em><\/p><p>As with any sex toy, it’s important to only use products that are of a high quality. C-rings come in many materials, though ideally you will want to opt for medical grade silicone as it is odorless and non-porous, meaning there’s no risk of infection like with other materials. Silicone is also ultra stretchy and flexible, providing the ultimate comfort for the wearer.<\/p><p><em><strong>Trim your pubes<\/strong><\/em><\/p><p>To avoid any uncomfortable pulling or snagging, it’s always helpful to trim your pubic hair, especially any right around the base of your penis.<\/p><p><em><strong>Use lube<\/strong><\/em><\/p><p>Lube is everyone’s best friend and a sex essential as it reduces friction and enhances sensation. When first putting your cock ring on, you might like to lube up your shaft so it can easily glide down to the base. Adding a small amount of lube to the inside of the ring is another helpful way to ensure easy and comfortable application.<\/p><p>When using silicone sex toys, be sure to only use water based lube - like Frenchie’s Oh La La Love Lube, and never silicone lube as this can degrade the material. <\/p><p><em><strong>Keep your c-ring clean<\/strong><\/em><\/p><p>To ensure proper hygiene and to avoid the risk of any infections, always be sure to thoroughly clean your sex toys before and after each use. This ensures there's no dust, dirt or dried bodily fluids on your pleasure tool. Use a quality sex toy cleaner or simple unscented soap with warm water and then dry with a clean, microfibre cloth. Always store your cock rings in their packaging away from dust.<\/p><p><em><strong>Duration of Use<\/strong><\/em><\/p><p>Due to the way c-rings constrict blood flow, it is not recommended to wear them for more than 20 - 30 minutes at a time. They are perfectly safe to use, however overuse could cause harm. So, be sure to remove your cock ring by the 30 minute mark.<\/p>"
          }
        },
        "a0c03cd1-483e-486d-ae06-62b6e2e700ba": {
          "type": "custom",
          "settings": {
            "custom_text_title": "Who should not use cock ring?",
            "custom_text_body": "<p>Some people with certain medical conditions relating to the nerves, arteries or muscles are advised not to use cock rings due to how it impacts blood flow. So if you are on blood thinning medications, have any blood clotting conditions or experience any of the following conditions, it’s best to opt out or consult a doctor before trying.<\/p><ul><li>Diabetes<\/li><li>Multiple sclerosis<\/li><li>Cirrhosis of the liver<\/li><li>Kidney failure<\/li><li>Alcoholism<\/li><li>Peyronie’s disease<\/li><li>Priapism<\/li><li>Difficulty urinating<\/li><li>Cardiac issues<\/li><\/ul>"
          }
        },
        "823867e1-51ae-4581-92b3-fc7daaa6a216": {
          "type": "advert",
          "disabled": true,
          "settings": {
            "product_headline": "Spice up it up",
            "product_1": "le-petit-lultimate-lovers-kit",
            "product_button_text": "View Product",
            "product_2": "",
            "product_button_text_2": "View Product",
            "product_3": "",
            "product_button_text_3": "View Product"
          }
        },
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "What You Can Do If All Else Fails",
            "custom_text_body": "<p><strong>Sexual Therapy<\/strong><\/p><p>There are specialist therepists who are trained in understanding the psychology of human sexulatiy, sex and relationships. They will be able to help you uncover what might going on for you, and give you the tools to help you overcome it.<\/p><p><\/p><p>Guided imagery is a method for managing your stress. It’s a relaxation technique that involves visualizing positive, peaceful settings like a beautiful beach or a peaceful meadow. This technique is also known as visualization or guided meditation.<\/p><p><strong>Guided Imagery<\/strong><\/p><p>It can be useful for ED as it helps you ground and relax before getting physical intimate. If abstract images like a calm beach don’t do it for you, it can also be helpful to visualise the sexaual energy in your body flowing into your genitals. <\/p><p><strong>Meditation <\/strong><\/p><p>Mindfulness or meditation is another useful tool that helps feel more calm , present and connected to our body. These are great skills for anyone experiencing ED. <\/p><p>Practice your mind\/body connection through mindfulness exercises such as body scans to help you still your mental world and focus on your physcial sensations. <\/p>"
          }
        },
        "dbbed86a-1223-4cd9-85eb-98b2175cb969": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "When to see a GP?",
            "custom_text_body": "<p>Of course, not all ED is caused by psychological or emotional reasons. <\/p><p>ED can be a symptom of many physical health concerns, and there might be something more serious going on. <\/p><p>It’s <span style=\"text-decoration:underline\">always<\/span> worthwhile seeing a GP to check nothing is going on physically. <\/p><p>This is especially true if:<\/p><p>- you can’t work out any emotional reasons for the change<\/p><p> - if you have diabetes, heart disease or another known health condition that might be linked to erectile dysfunction<\/p><p> -or you have other symptoms along with erectile dysfunction<\/p><p><\/p><p><\/p>"
          }
        },
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814": {
          "type": "cta",
          "disabled": true,
          "settings": {
            "cta-title": "Check this out",
            "cta-image": "shopify:\/\/shop_images\/Frenchie-Lube-Restock-2.1.jpg",
            "cta-link": "https:\/\/getfrenchie.com\/blogs\/news\/7-days-of-pleasure",
            "cta-link-text": "Click Here"
          }
        },
        "b095f3fd-4d01-4d74-a645-afe88cb56c98": {
          "type": "custom",
          "disabled": true,
          "settings": {
            "custom_text_title": "Summary",
            "custom_text_body": "<p>ED is much more common than people like to admit, and it is very very normal. Everybody experiences times of stress, worry or anxiety in life, and it is only natural for this to affect our sex life. <\/p><p>Sadly the silence,embarrassment and shame that often surrounds these conversations makes the problem worse, not better.<\/p><p>Instead, try and create an environment where pleasure and relaxation is the goal, and remove the pressure for an erection. When you stop fixating on the erection, you will discover that you are still capable of so much pleasure.<\/p>"
          }
        },
        "share": {
          "type": "share",
          "settings": {
            "share_label": "Share"
          }
        }
      },
      "block_order": [
        "title",
        "featured_image",
        "content",
        "af3bd32a-1f5f-42c0-9901-ef27f5e0d491",
        "e76e984e-79e5-41fc-9e36-a9cac2b1bfa0",
        "bed2e12d-ccf3-4b61-a43b-f301ff430db1",
        "74618ec1-d8e3-4453-9c5c-9b494dfb38e5",
        "effae05b-0392-4106-b39f-977cee9e326d",
        "305753e1-d53a-4828-bc2c-34873934a0b5",
        "a0c03cd1-483e-486d-ae06-62b6e2e700ba",
        "823867e1-51ae-4581-92b3-fc7daaa6a216",
        "c8e6c6ac-9c7e-41ba-82f8-9097cf67fe7a",
        "dbbed86a-1223-4cd9-85eb-98b2175cb969",
        "7ea6d6d8-985c-4808-a1e7-3c25bb2f2814",
        "b095f3fd-4d01-4d74-a645-afe88cb56c98",
        "share"
      ],
      "settings": {
      }
    },
    "1658801499aa58f4de": {
      "type": "featured-collection",
      "settings": {
        "title": "Our Best Sellers",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "frontpage",
        "products_to_show": 4,
        "columns_desktop": 4,
        "full_width": false,
        "show_view_all": true,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "inverse",
        "image_ratio": "adapt",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "columns_mobile": "2",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "heading": {
          "type": "heading",
          "settings": {
            "heading": "Subscribe to our emails",
            "heading_size": "h1"
          }
        },
        "paragraph": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Be the first to know about new collections and exclusive offers.<\/p>"
          }
        },
        "email-form": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "heading",
        "paragraph",
        "email-form"
      ],
      "settings": {
        "color_scheme": "accent-2",
        "full_width": true,
        "padding_top": 60,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "main",
    "1658801499aa58f4de",
    "newsletter"
  ]
}